{
    "0": {
        "name": "任务分配",
        "description": "帮助学生合理分配任务时间和角色，确保团队合作有序进行。通过清晰的任务分解和时间规划，帮助学生有条不紊地完成任务。",
        "example": [
            "“你们的任务是什么？每个人应该负责哪一部分？” “试着讨论一下，谁对哪个部分更感兴趣，可能更适合负责这部分内容？”",
            "项目可以分为几大部分：研究、数据分析、报告撰写和最终展示。你们可以先讨论一下每个人的特长，比如擅长调研的同学可以负责资料收集，数据处理能力强的同学负责分析。比如，你觉得哪位同学更适合负责数据分析？你呢，能否承担报告撰写？结合你们之前的经验，具体分工会让整个项目进展更顺畅。"
        ]
    },
    "1": {
        "name": "角色引导",
        "description": "通过角色分配，明确学生在团队中的责任和贡献，帮助学生找到自己在团队中的定位和作用。",
        "example": [
            "“你觉得你在团队中的角色是什么？可以试着思考下每个人的职责是什么。” “如果你是这个项目的负责人，你会如何带领团队？”",
            "“在这个项目中，你可能需要扮演协调者的角色，比如负责监督每个阶段的进展，确保每个人按时完成任务。” “你可以扮演组织者的角色，帮助团队进行有效的沟通和协调。”"
        ]
    },
    "2": {
        "name": "重申任务",
        "description": "通过重申任务，帮助学生明确的任务解释，帮助学生理解任务的目标和步骤，从而更好地执行任务。",
        "example": [
            "“你们觉得现在的任务目标清晰吗？可以再重复一下吗？” “请再解释一下你们目前的任务是做什么。”",
            "“你们的任务是完成本阶段的目标,你可以看一下本阶段的任务要求.” “确保每个团队成员清楚任务的几个主要部分，并了解自己的具体职责。”"
        ]
    },
    "3": {
        "name": "头脑风暴引导",
        "description": "通过头脑风暴技巧，鼓励学生提出尽可能多的创意和想法，打破常规思维模式，拓宽思路。",
        "example": [
            "“你们有一些想法了吗？可以先随意说出你们的想法，不用担心对错。” “试着考虑一些大胆的想法，不用局限在常规思路里。”",
            "“让我们先集中讨论一个具体问题，比如如何减少学校的用水量。你们可以列出五个可能的措施。” “每个人提出至少三个方案，我们会集中讨论并逐一评估。”"
        ]
    },
    "4": {
        "name": "随机联想与激发创意",
        "description": "通过随机联想法或使用刺激性材料（如图片、关键词）激发学生的创造力，帮助他们跳出固定思维框架。",
        "example": [
            "“你能想到一些与水资源或节能相关的日常事物吗？比如你每天使用的哪些物品涉及水？” “试着从你最近看到的一些图片或新闻中找到灵感。”",
            "“假设你是一位环保专家，你会如何建议学校减少水资源浪费？可以从不同场景中随机选择一些常见物品，比如水壶、雨水收集系统，思考如何利用这些物品激发新的创意。”"
        ]
    },
    "5": {
        "name": "创意筛选与聚焦",
        "description": "指导学生使用创意筛选工具（如Pugh矩阵）筛选出最具潜力的创意，并通过主题聚焦方法集中思考。",
        "example": [
            "“现在你们有很多想法了，你觉得哪些方案是可行的？可以试着筛选出最有可能实施的方案。” “你们可以通过哪些标准来决定最有效的解决方案？”",
            "“从这些方案中挑选出两个最具可行性并且可以在短期内实施的解决方案。你们可以根据成本、实施难度和影响力来做出决定。” “你们可以设定几个筛选标准，比如是否符合环保原则、可操作性强，然后选择出最优的方案。”"
        ]
    },
    "6": {
        "name": "案例引导与示例",
        "description": "通过实际案例和示例，帮助学生理解和应用所学内容，引导他们将理论与实践相结合，提升学习效果。",
        "example": [
            "“你们可以参考其他学校在环保方面的措施来启发自己，看看他们是如何减少用水的。” “你们听说过哪些成功的节水案例？可以在讨论中分享一下。”",
            "“这个案例中，学校通过安装低流量水龙头减少了30%的水资源浪费。你们可以考虑类似的做法，想想在你们学校是否可行。” “我建议你们看一看这个关于雨水收集系统的成功案例，试着借鉴其中的关键步骤。”"
        ]
    },
    "7": {
        "name": "挑战引导",
        "description": "通过提出具有挑战性的问题或场景，引导学生深入思考问题的不同角度，鼓励他们提出创新的解决方案。",
        "example": [
            "“你觉得这方案真的能解决问题吗？可以再深入想一想。” “有没有可能还有一些潜在的困难？你们可以提前考虑吗？”",
            "“如果我们在实施中遇到技术上的困难，比如安装水龙头系统的预算不足，你们有什么应对措施？” “考虑到资源有限，你们如何在不增加预算的情况下完成这个项目？”"
        ]
    },
    "8": {
        "name": "追问引导",
        "description": "通过不断追问“为什么”，引导学生深入思考问题的本质和根源，避免停留在表面。",
        "example": [
            "“为什么你觉得这个方案会有效？有没有其他可能性？” “你能解释一下背后的原理吗？”",
            "“你认为这个方案的最大优势是什么？如果我们假设这个方案不能完全解决问题，还有什么备选方案？” “如果我们遇到阻力，你觉得最大的阻力来自哪里？如何克服？”"
        ]
    },
    "9": {
        "name": "系统思维训练",
        "description": "通过引导学生理解问题的整体系统和各个组成部分的相互关系，培养他们从全局角度分析问题的能力。",
        "example": [
            "“你能不能描述一下这个问题的整个系统，比如哪些因素相互影响？” “这个问题是如何影响其他相关问题的？”",
            "“在这个系统中，水资源浪费是一个节点，你们可以思考这个节点如何影响其他节点，比如能源消耗和经济成本。” “尝试绘制一张问题影响图，展示不同因素如何相互关联，比如天气、资源消耗和环境保护。”"
        ]
    },
    "10": {
        "name": "批判性思维练习",
        "description": "引导学生对每个想法进行批判性分析，寻找其中的逻辑漏洞和假设，培养他们的批判性思维能力。",
        "example": [
            "“你们觉得这个方案有没有什么不足？可以从多个角度看待它。” “是否有一些其他的解决方案可以与之相比？它们各自的优缺点是什么？”",
            "“在这项方案中，有没有一些潜在的负面影响，比如成本过高或对学校的正常运作产生干扰？你们如何评估这些风险？” “你们可以从反面的角度来思考，比如如果这个方案失败了，问题可能会出现在什么地方？”"
        ]
    },
    "11": {
        "name": "深入思考与反思",
        "description": "鼓励学生在完成任务后进行深入的自我反思，并通过反馈帮助他们发现改进点。通过引导学生深入探讨问题的根源，培养他们的批判性思维和系统性思考能力。",
        "example": [
            "“你们现在对自己提出的方案有什么新的思考吗？有没有发现可以改进的地方？” “在这个过程中，你们有没有遇到一些意外的挑战，如何解决的？”",
            "“现在回头看，你们的方案与最初的设想有何不同？是什么导致了这些改变？你们是否有新的见解可以帮助进一步完善方案？” “从这个项目中，你们学到了什么？如果重新开始，你们会选择不同的方式吗？”"
        ]
    },
    "12": {
        "name": "反驳与辩论",
        "description": "引导学生从相反的立场进行思考和辩论，挑战他们的观点，帮助他们发现并修正思维中的偏见和盲点。",
        "example": [
            "“你们可以从对立的角度来思考这个问题，尝试反驳自己提出的方案，看看它是否站得住脚。” “大家可以提出不同的意见，讨论一下不同的观点。”",
            "“你们可以进行一场辩论，两个团队分别为各自的方案辩护，并找出其中的缺陷和不足。” “设定一个情境，比如资金减少，你们需要为优先实施哪个方案辩护，谁的方案更具说服力？”"
        ]
    },
    "13": {
        "name": "资源引导",
        "description": "提供与任务相关的资源，帮助学生在学习过程中获取必要的支持和知识，确保他们能够有效完成任务。",
        "example": [
            "“你们目前有哪些资源可以利用？可以列出来讨论一下。” “有没有一些你们还没有考虑到的资源可以用来支持方案？”",
            "“你们可以访问学校的资源中心，查找一些有助于解决问题的数据和工具。同时，你们可以联系一些外部组织寻求支持。” “从学校的节水项目中找出一些可以利用的资源，比如现有的设施或专家的建议。”"
        ]
    },
    "14": {
        "name": "内容回顾",
        "description": "提供与任务相关的前期知识内容,帮助学生回忆所需的支持,帮助起完成相关任务。",
        "example": [
            "“你们可以回顾一下之前讨论的要点吗？看看有没有遗漏的地方。” “在完成任务之前，你们可以再次审查一下所有内容，确保无误。”",
            "“让我们一起回顾一下，首先你们分析了问题，然后提出了三种解决方案，最后选择了最可行的方案。接下来我们可以开始执行了吗？” “你们可以通过复习之前的工作，找出是否有遗漏或需要进一步修正的地方。”"
        ]
    },
    "15": {
        "name": "信息搜集与分类",
        "description": "教授学生如何通过多种途径收集信息，并指导他们对信息进行分类和整理，确保信息来源的多样性和准确性。",
        "example": [
            "“你们现在已经收集了不少信息，可以试着将它们分类，看看它们分别属于哪些类别。” “你们觉得这些信息能否为方案提供足够的支持？”",
            "“你们可以将信息按时间、类别或来源进行分类，这样能帮助你们更好地进行分析和决策。” “试着将收集到的资料进行分类，比如与水资源管理、学校政策和环保相关的资料分开整理。”"
        ]
    },
    "16": {
        "name": "信息整合引导",
        "description": "通过演练或练习，引导学生将来自不同来源的信息整合成一个完整的解决方案，确保方案的连贯性和有效性。",
        "example": [
            "“你们已经找到了很多信息，能否把它们整合成一个整体的解决方案？” “你们可以从这些信息中总结出关键的部分吗？”",
            "“你们可以把所有的相关数据汇总到一个表格中，并尝试找出它们之间的联系，帮助你们做出更有逻辑的决策。” “你们可以从多个来源的数据中提取出关键点，并把它们组合成一个连贯的方案。”"
        ]
    },
    "17": {
        "name": "情景模拟与场景反馈",
        "description": "通过模拟场景或情景设定，让学生在真实情境中应用所学知识，并通过反馈帮助他们更好地理解和解决问题。",
        "example": [
            "“你们可以想象一下，如果在实际中实施这个方案，会遇到哪些问题？” “你们可以在小组内模拟一下可能的情况，看看会发生什么。”",
            "“我们可以一起进行一个模拟演练，假设你们已经开始实施这个项目。让我们看看会有哪些意外情况出现。” “你们可以在模拟中观察，如果资源有限或者时间不足，方案的效果是否会受到影响。”"
        ]
    },
    "18": {
        "name": "鼓励与动机",
        "description": "通过正向反馈和鼓励，激发学生的学习动机和信心，帮助他们克服困难并持续参与到任务中。",
        "example": [
            "“你们已经做得很棒了，继续保持这个势头！还有什么你们觉得可以做得更好的地方吗？” “尽管遇到了一些困难，你们的进展已经很不错了，继续加油！”",
            "“你们现在已经完成了最困难的部分，接下来只需要细化方案，成果就会显而易见了。继续努力！” “你们的努力很值得肯定，看到你们一步步接近目标真令人振奋！”"
        ]
    },
    "19": {
        "name": "情感疏导",
        "description": "关注学生的情绪状态，提供适当的情感支持和压力管理策略，帮助学生应对学习中的压力和情绪挑战。",
        "example": [
            "“你们看起来有些疲惫，想休息一下再继续吗？调整一下心情可能会帮助你们更好地思考。” “遇到困难时不要气馁，你们可以分阶段完成任务，不需要一口气解决所有问题。”",
            "“我知道你们目前面临的压力很大，但不要忘了分阶段进行，每一步都有重要的意义。我们可以一起解决这个问题。” “你们的情绪是很正常的，困难是学习过程中的一部分，我们可以讨论如何更好地应对压力。”"
        ]
    },
    "20": {
        "name": "组间鼓励",
        "description": "鼓励组间的合作和讨论，激发学生在小组中的参与度和积极性，促进团队的协作和创新。",
        "example": [
            "“看看其他小组的做法，你们觉得他们的方案有什么值得借鉴的吗？” “你们觉得和其他小组的合作能带来什么样的启发？”",
            "“你们可以和其他小组交流一下进展，这样能帮助你们获得新的灵感，并相互支持。” “现在可以请其他小组来看看你们的方案，听取他们的意见，这可能会帮助你们发现一些新思路。”"
        ]
    },
    "21": {
        "name": "即时反馈",
        "description": "能够针对学生的问题给予及时的反馈。",
        "example": [
            "“你们现在对自己的进展有什么看法？有什么需要调整的吗？” “你们觉得现在的方案是否达到了预期的效果？可以随时调整。”",
            "“在你们展示方案之前，我建议你们先检查一下每个步骤，看看是否还有需要改进的地方。我们可以及时调整。” “你们已经做得很棒了，现在只是一些细节的调整，相信最终结果会更加完美。”"
        ]
    }
}
